fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Договоры</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы
	
&НаСервере
Функция ЗаполнитьНаСервере()

	 ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.ПолучитьДанныеДлятаблицы", 
      Объект.Период);

КонецФункции

&НаКлиенте
Процедура Заполнить(Команда)
	
	 ДлительнаяОперация = ЗаполнитьНаСервере();
     ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
     ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
     ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
     
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
	
     Если Результат = Неопределено Тогда
     	
     	Возврат;
      
     КонецЕсли;
     
     ДанныеТЧ = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
     
     Если ДанныеТЧ = Неопределено Тогда
     	Возврат;
     КонецЕсли;
     
     Для Каждого Строка Из ДанныеТЧ Цикл
     	
     	СтрокаТЧ = Объект.Договоры.Добавить();
		СтрокаТЧ.Договор = Строка.Договор;
		СтрокаТЧ.Реализация = Строка.Реализация;
     	
     КонецЦикла;
     
     Элементы.Договоры.Обновить();
     
КонецПроцедуры

#КонецОбласти
